Database: opt 
Restore: NO

Operator : avg 
Number   : 1
Signature: (stream tuple) -> real
Example  : query Staedte feed avg[Bev] 
Result   : 325017.2413793103


Operator : +
Number   : 1
Signature: (real real) -> real, 
Example  : query -1.2 + 7.0
Result   : 5.8 


Operator : sortby 
Number   : 1
Signature: rel(tuple) -> int 
Example  : query ten feed sortby[no asc] consume 
Result   : file 

Operator : sortby  alias SORTBY 
Number   : 2 
Signature: rel(tuple) -> int 
Example  : query ten feed sortby[no asc] consume 
Result   : file 

