Database : symtraj
Restore  : No

Operator : tolabel
Number   : 1
Signature: (string | text) -> label
Example  : query tolabel('Aubameyang')
Result   : (label "Aubameyang")

Operator : tostring
Number   : 1
Signature: label -> string
Example  : query tostring(tolabel('Aubameyang'))
Result   : "Aubameyang"

Operator : totext
Number   : 1
Signature: label -> text
Example  : query totext(tolabel('Aubameyang'))
Result   : 'Aubameyang'

Operator : mstringtomlabel
Number   : 1
Signature: mstring -> mlabel
Example  : query mstringtomlabel(SymbolicTripsTiny feed extract[SymTrip]) matches '(_ at_home) *'
Result   : FALSE

Operator : contains
Number   : 1
Signature: labels x string -> bool
Example  : query [const labels value ("Hummels" "Reus")] contains "Reus"
Result   : TRUE

Operator : the_unit
Number   : 6
Signature: label x instant x instant x bool x bool -> ulabel
Example  : query the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE)
Result   : (ulabel (("2000-01-03" "2000-01-04" TRUE FALSE)"Mkhitaryan"))

Operator : makemvalue
Number   : 7
Signature: stream (tuple ((x1 t1)...(xi ulabel)...(xn tn))) xi -> mlabel
Example  : query the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem]
Result   : (mlabel ((("2000-01-03" "2000-01-04" TRUE FALSE)"Mkhitaryan")))

Operator : passes
Number   : 6
Signature: mlabel x label -> bool
Example  : query michael passes tolabel("at_mensa")
Result   : TRUE

Operator : at
Number   : 4
Signature: mlabel x label -> mlabel
Example  : query michael at tolabel("sportclub")
Result   : (mlabel ((("2011-12-10-18:20" "2011-12-10-20:00" TRUE FALSE)"sportclub") (("2011-12-17-18:20" "2011-12-17-20:00" TRUE FALSE)"sportclub")))

Operator : deftime
Number   : 4
Signature: mlabel -> periods
Example  : query deftime(the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem])
Result   : (periods (("2000-01-03" "2000-01-04" TRUE FALSE)))

Operator : units
Number   : 5
Signature: mlabel -> (stream ulabel)
Example  : query units(michael) count
Result   : 62

Operator : initial
Number   : 12
Signature: ulabel -> ilabel
Example  : query initial(the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE))
Result   : (ilabel ("2000-01-03" "Mkhitaryan"))

Operator : final
Number   : 12
Signature: ulabel -> ilabel
Example  : query final(the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE))
Result   : (ilabel ("2000-01-04" "Mkhitaryan"))

Operator : val
Number   : 4
Signature: ilabel -> label
Example  : query val([const ilabel value ("2013-10-29" "Mkhitaryan")])
Result   : (label "Mkhitaryan")

Operator : inst
Number   : 4
Signature: ilabel -> instant
Example  : query inst([const ilabel value ("2013-10-29" "Mkhitaryan")])
Result   : (instant "2013-10-29")

Operator : inside
Number   : 1
Signature: mlabel x label -> mbool
Example  : query the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem] inside tolabel("Mkhitaryan")
Result   : (mbool ((("2000-01-03" "2000-01-04" TRUE FALSE)TRUE)))

Operator : topattern
Number   : 1
Signature: text -> pattern
Example  : query michael matches ('(_ at_home) * (_ at_home)' topattern)
Result   : TRUE

Operator : toclassifier
Number   : 1
Signature: stream(tuple(description: text, pattern: text)) -> classifier
Example  : query classify(michael, class2 feed toclassifier) count
Result   : 0

Operator : matches
Number   : 1
Signature: mlabel x text -> bool
Example  : query michael matches 'A * B (_ sportclub) C * D (_ sportclub) E * // A.card > E.card'
Result   : TRUE

Operator : filtermatches
Number   : 1
Signature: stream(tuple(X)) x IDENT x text -> stream(tuple(X))
Example  : query Dotraj feed filtermatches[Trajectory, '(_ "Innenstadt-Ost") X * () // X.labels contains "Brackel"'] count
Result   : 11

Operator : indexmatches
Number   : 1
Signature: rel(tuple(X)) x IDENT x text -> stream(tuple(X))
Example  : query Dotraj indexmatches[Trajectory, Dotrajindex, '(_ "Innenstadt-Ost") * (_ "Innenstadt-West")'] count
Result   : 4

Operator : rewrite
Number   : 0
Signature: mlabel x text -> stream(mlabel)
Example  : query rewrite(michael, 'X * Y [(_ at_home) | (_ sportclub)]+ Z * => Y') count
Result   : 56
 
Operator : classify
Number   : 1
Signature: mlabel x classifier -> stream(text)
Example  : query classify(michael, classifier2) count
Result   : 0

Operator : indexclassify
Number   : 1
Signature: rel(tuple(..., mlabel, ...)) x attrname x invfile x classifier -> stream(tuple(string, mlabel))
Example  : query Dotraj indexclassify [Trajectory, Dotrajindex, classifier3] count
Result   : 7

Operator : rewrite
Number   : 1
Signature: stream(text) x stream(mlabel) -> stream(mlabel)
Example  : query rewrite(Dotraj feed projecttransformstream[Trajectory], rewrite1 feed projecttransformstream[Pattern]) count
Result   : 133

Operator : compress
Number   : 1
Signature: mlabel -> mlabel
Example  : query compress([const mlabel value ((("2013-01-01" "2013-01-02" TRUE FALSE) "at_home") (("2013-01-02" "2013-01-03" TRUE FALSE) "at_home"))])
Result   : (mlabel ((("2013-01-01" "2013-01-03" TRUE FALSE) "at_home")))

Operator : compress
Number   : 3
Signature: stream(mlabel) -> stream(mlabel)
Example  : query compress(SymbolicTripsTiny feed head[1] projecttransformstream[SymTrip]) = (SymbolicTripsTiny feed head[1] projecttransformstream[SymTrip])
Result   : FALSE

Operator : fillgaps
Number   : 1
Signature: mlabel -> mlabel
Example  : query fillgaps([const mlabel value ((("2012-10-01" "2012-10-02-05:00:00" TRUE FALSE) "at_home") (("2012-10-02-05:00:58" "2012-10-02-07:00:00" TRUE FALSE) "at_home"))], 60000)
Result   : (mlabel ((("2012-10-01" "2012-10-02-07:00" TRUE FALSE) "at_home")))

Operator : createml
Number   : 1
Signature: int x real -> mlabel
Example  : query createml(2, 0.5) matches '() ()'
Result   : TRUE

Operator : createmlrelation
Number   : 1
Signature: int x int x string -> bool
Example  : query createmlrelation(10, 50, "Dotraj")
Result   : FALSE

Operator : createindex
Number   : 1
Signature: mlabel -> mlabel
Example  : query createindex(michael) getTypeNL
Result   : (text 'mlabel')

Operator : createtrie
Number   : 1
Signature: rel(tuple(..., mlabel, ...)) x attrname -> invfile
Example  : query Dotraj createtrie[Trajectory]
Result   : unpredictable
Remark   : A InvFile has no out function
