Database : symtraj
Restore  : No

Operator : tolabel
Number   : 1
Signature: (string | text) -> label
Example  : query tolabel('abc')
Result   : (label "abc")

Operator : mstringtomlabel
Number   : 1
Signature: mstring -> mlabel
Example  : query mstringtomlabel(SymbolicTripsTiny feed extract[SymTrip]) matches '(_ at_home) *'
Result   : FALSE

Operator : contains
Number   : 1
Signature: labels x string -> bool
Example  : query [const labels value ("Hummels" "Reus")] contains "Reus"
Result   : TRUE

Operator : the_unit
Number   : 6
Signature: label x instant x instant x bool x bool -> ulabel
Example  : query the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE)
Result   : (ulabel (("2000-01-03" "2000-01-04" TRUE FALSE)"Mkhitaryan"))

Operator : makemvalue
Number   : 7
Signature: stream (tuple ((x1 t1)...(xi ulabel)...(xn tn))) xi -> mlabel
Example  : query the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem]
Result   : (mlabel ((("2000-01-03" "2000-01-04" TRUE FALSE)"Mkhitaryan")))

Operator : topattern
Number   : 1
Signature: text -> pattern
Example  : query michael matches ('(_ at_home) * (_ at_home)' topattern)
Result   : TRUE

Operator : toclassifier
Number   : 1
Signature: stream(tuple(description: text, pattern: text)) -> classifier
Example  : query classify(michael, class2 feed toclassifier) count
Result   : 0

Operator : matches
Number   : 1
Signature: mlabel x text -> bool
Example  : query michael matches '()'
Result   : FALSE

Operator : indexmatches
Number   : 1
Signature: rel(tuple(X)) x IDENT x invfile x text -> stream(tuple(X))
Example  : query Dotraj indexmatches[Trajectory, Dotrajindex, '(_ "Innenstadt-Ost") X * () // X.labels contains "Brackel"'] count
Result   : 25

Operator : filtermatches
Number   : 1
Signature: stream(tuple(X)) x IDENT x text -> stream(tuple(X))
Example  : query Dotraj feed filtermatches[Trajectory, '(_ "Innenstadt-Ost") X * () // X.labels contains "Brackel"'] count
Result   : 25

Operator : rewrite
Number   : 0
Signature: mlabel x text -> stream(mlabel)
Example  : query rewrite(michael, '* () Z * => Z') count
Result   : 62
 
Operator : classify
Number   : 1
Signature: mlabel x classifier -> stream(text)
Example  : query classify(michael, classifier2) count
Result   : 0

Operator : indexclassify
Number   : 1
Signature: rel(tuple(..., mlabel, ...)) x attrname x invfile x classifier-> stream(tuple(string, mlabel))
Example  : query (Dotraj indexclassify[Trajectory, Dotrajindex, classifier1]) count
Result   : 234

Operator : rewrite
Number   : 1
Signature: stream(text) x stream(mlabel) -> stream(mlabel)
Example  : query rewrite(Dotraj feed projecttransformstream[Trajectory], rewrite1 feed projecttransformstream[Pattern]) count
Result   : 71

Operator : compress
Number   : 1
Signature: mlabel -> mlabel
Example  : query compress([const mlabel value ((("2013-01-01" "2013-01-02" TRUE FALSE) "at_home") (("2013-01-02" "2013-01-03" TRUE FALSE) "at_home"))])
Result   : (mlabel ((("2013-01-01" "2013-01-03" TRUE FALSE) "at_home")))

Operator : compress
Number   : 3
Signature: stream(mlabel) -> stream(mlabel)
Example  : query compress(SymbolicTripsTiny feed head[1] projecttransformstream[SymTrip]) = (SymbolicTripsTiny feed head[1] projecttransformstream[SymTrip])
Result   : FALSE

Operator : fillgaps
Number   : 1
Signature: mlabel -> mlabel
Example  : query fillgaps([const mlabel value ((("2012-10-01" "2012-10-02-05:00:00" TRUE FALSE) "at_home") (("2012-10-02-05:00:58" "2012-10-02-07:00:00" TRUE FALSE) "at_home"))], 60000)
Result   : (mlabel ((("2012-10-01" "2012-10-02-07:00" TRUE FALSE) "at_home")))

Operator : createml
Number   : 1
Signature: int x real -> mlabel
Example  : query createml(2, 0.5) matches '() ()'
Result   : TRUE

Operator : createmlrelation
Number   : 1
Signature: int x int x string -> bool
Example  : query createmlrelation(10, 50, "Dotraj")
Result   : FALSE

Operator : createindex
Number   : 1
Signature: mlabel -> mlabel
Example  : query createindex(michael) matches '* (_ at_home)'
Result   : TRUE

Operator : createtrie
Number   : 1
Signature: rel(tuple(..., mlabel, ...)) x attrname -> invfile
Example  : query Dotraj createtrie[Trajectory]
Result   : unpredictable
Remark   : A InvFile has no out function