Database : symtrajsmall
Restore  : No

Operator : tolabel
Number   : 1
Signature: (string | text) -> label
Example  : query tolabel('Aubameyang')
Result   : (label ('Aubameyang'))

Operator : tostring
Number   : 1
Signature: label -> string
Example  : query tostring(tolabel('Aubameyang'))
Result   : "Aubameyang"

Operator : totext
Number   : 1
Signature: label -> text
Example  : query totext(tolabel('Aubameyang'))
Result   : 'Aubameyang'

Operator : mstringtomlabel
Number   : 1
Signature: mstring -> mlabel
Example  : query mstringtomlabel([const mstring value ((("2013-01-01" "2013-01-02" TRUE FALSE) "at_home"))]) matches '(_ at_home) *'
Result   : TRUE

Operator : contains
Number   : 1
Signature: labels x label -> bool
Example  : query [const labels value ("Hummels" "Reus")] contains tolabel("Reus")
Result   : TRUE

Operator : contains
Number   : 2
Signature: places x place -> bool
Example  : query [const places value (("Mkhitaryan" 10) ("Jojic" 14))] contains toplace("Reus", 11)
Result   : FALSE

Operator : toplace
Number   : 1
Signature: string x int -> place
Example  : query toplace("Reus", 11)
Result   : (place ('Reus' 11))

Operator : name
Number   : 1
Signature: place -> text
Example  : query name([const place value ("Hummels" 5)])
Result   : 'Hummels'

Operator : ref
Number   : 1
Signature: place -> int
Example  : query ref([const place value ("Hummels" 5)])
Result   : 5

Operator : the_unit
Number   : 6
Signature: label x instant x instant x bool x bool -> ulabel
Example  : query the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE)
Result   : (ulabel (("2000-01-03" "2000-01-04" TRUE FALSE)'Mkhitaryan'))

Operator : the_unit
Number   : 7
Signature: place x instant x instant x bool x bool -> uplace
Example  : query the_unit(toplace("Mkhitaryan", 10), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE)
Result   : (uplace (("2000-01-03" "2000-01-04" TRUE FALSE) ('Mkhitaryan' 10)))

Operator : makemvalue
Number   : 7
Signature: stream (tuple ((x1 t1)...(xi ulabel)...(xn tn))) xi -> mlabel
Example  : query the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem]
Result   : (mlabel ((("2000-01-03" "2000-01-04" TRUE FALSE)'Mkhitaryan')))

Operator : makemvalue
Number   : 8
Signature: stream (tuple ((x1 t1)...(xi uplace)...(xn tn))) xi -> mplace
Example  : query the_unit(toplace("Mkhitaryan", 10), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem]
Result   : (mplace ((("2000-01-03" "2000-01-04" TRUE FALSE) ('Mkhitaryan' 10))))

Operator : passes
Number   : 6
Signature: mlabel x label -> bool
Example  : query mlabel1 passes tolabel("Eving")
Result   : TRUE

Operator : at
Number   : 4
Signature: mlabel x label -> mlabel
Example  : query mlabel1 at tolabel("Eving")
Result   : (mlabel ((("2012-01-01" "2012-01-01-00:30" TRUE FALSE)'Eving')))

Operator : deftime
Number   : 4
Signature: mlabel -> periods
Example  : query deftime(the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem])
Result   : (periods (("2000-01-03" "2000-01-04" TRUE FALSE)))

Operator : atinstant
Number   : 4
Signature: mlabel -> ilabel
Example  : query mlabel1 atinstant [const instant value "2012-01-01-01:15"]
Result   : (ilabel ("2012-01-01-01:15" "Brackel"))

Operator : units
Number   : 5
Signature: mlabel -> (stream ulabel)
Example  : query units(mlabel1) count
Result   : 6

Operator : initial
Number   : 12
Signature: ulabel -> ilabel
Example  : query initial(the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE))
Result   : (ilabel ("2000-01-03" "Mkhitaryan"))

Operator : final
Number   : 12
Signature: ulabel -> ilabel
Example  : query final(the_unit(tolabel("Mkhitaryan"), [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE))
Result   : (ilabel ("2000-01-04" "Mkhitaryan"))

Operator : val
Number   : 4
Signature: ilabel -> label
Example  : query val([const ilabel value ("2013-10-29" "Mkhitaryan")])
Result   : (label ("Mkhitaryan"))

Operator : inst
Number   : 4
Signature: ilabel -> instant
Example  : query inst([const ilabel value ("2013-10-29" "Mkhitaryan")])
Result   : (instant "2013-10-29")

Operator : inside
Number   : 1
Signature: mlabel x labels -> mbool
Example  : query (mlabel1 inside [const labels value ("Innenstadt-Ost")]) at TRUE
Result   : (mbool ((("2012-01-01-01:30" "2012-01-01-02:00" TRUE FALSE)TRUE)))








Operator : the_unit
Number   : 8
Signature: labels x instant x instant x bool x bool -> ulabels
Example  : query the_unit([const labels value ("Mkhitaryan" "Reus")], [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE)
Result   : (ulabels (("2000-01-03" "2000-01-04" TRUE FALSE) ('Mkhitaryan' 'Reus')))

Operator : the_unit
Number   : 9
Signature: places x instant x instant x bool x bool -> uplaces
Example  : query the_unit([const places value (("Mkhitaryan" 10) ("Reus" 11))], [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE)
Result   : (uplaces (("2000-01-03" "2000-01-04" TRUE FALSE) (('Mkhitaryan' 10) ('Reus' 11))))

Operator : makemvalue
Number   : 9
Signature: stream (tuple ((x1 t1)...(xi ulabels)...(xn tn))) xi -> mlabels
Example  : query the_unit([const labels value ("Mkhitaryan" "Reus")], [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem]
Result   : (mlabels ((("2000-01-03" "2000-01-04" TRUE FALSE) ('Mkhitaryan' 'Reus'))))

Operator : makemvalue
Number   : 10
Signature: stream (tuple ((x1 t1)...(xi uplaces)...(xn tn))) xi -> mplaces
Example  : query the_unit([const places value (("Mkhitaryan" 10) ("Reus" 11))], [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem]
Result   : (mplaces ((("2000-01-03" "2000-01-04" TRUE FALSE) (('Mkhitaryan' 10) ('Reus' 11)))))

Operator : passes
Number   : 7
Signature: mlabels x label -> bool
Example  : query mlabels1 passes tolabel("Hummels")
Result   : TRUE

Operator : passes
Number   : 8
Signature: mlabels x labels -> bool
Example  : query mlabels1 passes [const labels value ("Jojic" "Ji")]
Result   : FALSE

Operator : deftime
Number   : 5
Signature: mlabels -> periods
Example  : query deftime(the_unit([const labels value ("Mkhitaryan" "Reus")], [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE) feed transformstream makemvalue[Elem])
Result   : (periods (("2000-01-03" "2000-01-04" TRUE FALSE)))

Operator : units
Number   : 6
Signature: mlabels -> (stream ulabels)
Example  : query units(mlabels1) count
Result   : 3

Operator : initial
Number   : 13
Signature: ulabels -> ilabels
Example  : query initial(the_unit([const labels value ("Mkhitaryan")], [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE))
Result   : (ilabels ("2000-01-03" ("Mkhitaryan")))

Operator : final
Number   : 13
Signature: ulabels -> ilabels
Example  : query final(the_unit([const labels value ("Schmelzer" "Mkhitaryan")], [const instant value "2000-01-03"], [const instant value "2000-01-04"], TRUE, FALSE))
Result   : (ilabels ("2000-01-04" ("Schmelzer" "Mkhitaryan")))

Operator : val
Number   : 5
Signature: ilabels -> label
Example  : query val([const ilabels value ("2013-10-29" ("Mkhitaryan" "Jojic"))])
Result   : (labels ("Mkhitaryan" "Jojic"))

Operator : inst
Number   : 5
Signature: ilabels -> instant
Example  : query inst([const ilabels value ("2013-10-29" ("Mkhitaryan" "Jojic"))])
Result   : (instant "2013-10-29")

Operator : atinstant
Number   : 5
Signature: mlabels -> ilabels
Example  : query mlabels1 atinstant [const instant value "2014-07-07-11:00"]
Result   : (ilabels ("2014-07-07-11:00" ("Ji" "Jojic")))









Operator : topattern
Number   : 1
Signature: text -> pattern
Example  : query mlabel1 matches ('(_ "Eving") * (_ "Innenstadt-Ost") +' topattern)
Result   : TRUE

Operator : toclassifier
Number   : 1
Signature: stream(tuple(description: text, pattern: text)) -> classifier
Example  : query classify(mlabel1, class3 feed toclassifier) count
Result   : 0

Operator : matches
Number   : 1
Signature: mlabel x text -> bool
Example  : query mlabel1 matches '(_ "Eving") * (_ "Innenstadt-Ost") +'
Result   : TRUE

Operator : filtermatches
Number   : 1
Signature: stream(tuple(X)) x IDENT x text -> stream(tuple(X))
Example  : query Dotraj feed filtermatches[Trajectory, '(_ "Innenstadt-Ost") X * () // X.labels contains tolabel("Brackel")'] count
Result   : 1

Operator : indexmatches
Number   : 1
Signature: rel(tuple(X)) x IDENT x text -> stream(tuple(X))
Example  : query Dotraj indexmatches[Trajectory, Dotraj createtrie[Trajectory], '(_ "Aplerbeck") * (_ "Innenstadt-Ost") *'] count
Result   : 2

Operator : rewrite
Number   : 0
Signature: mlabel x text -> stream(mlabel)
Example  : query rewrite(mlabel1, 'X * Y [(_ "Scharnhorst") | (_ "Brackel")]+ Z * => Y') count
Result   : 3
 
Operator : classify
Number   : 1
Signature: mlabel x classifier -> stream(text)
Example  : query classify(mlabel1, class3 feed toclassifier) count
Result   : 0

Operator : indexclassify
Number   : 1
Signature: rel(tuple(..., mlabel, ...)) x attrname x invfile x classifier -> stream(tuple(string, mlabel))
Example  : query Dotraj indexclassify [Trajectory, Dotraj createtrie[Trajectory], class3 feed toclassifier] count
Result   : 0

Operator : rewrite
Number   : 1
Signature: stream(text) x stream(mlabel) -> stream(mlabel)
Example  : query rewrite(Dotraj feed projecttransformstream[Trajectory], rewrite1 feed projecttransformstream[Pattern]) count
Result   : 3

Operator : compress
Number   : 1
Signature: mlabel -> mlabel
Example  : query compress([const mlabel value ((("2013-01-01" "2013-01-02" TRUE FALSE) "at_home") (("2013-01-02" "2013-01-03" TRUE FALSE) "at_home"))])
Result   : (mlabel ((("2013-01-01" "2013-01-03" TRUE FALSE) "at_home")))

Operator : compress
Number   : 3
Signature: stream(mlabel) -> stream(mlabel)
Example  : query compress(Dotraj feed projecttransformstream[Trajectory]) = (Dotraj feed projecttransformstream[Trajectory])
Result   : FALSE

Operator : fillgaps
Number   : 1
Signature: mlabel -> mlabel
Example  : query fillgaps([const mlabel value ((("2012-10-01" "2012-10-02-05:00:00" TRUE FALSE) "at_home") (("2012-10-02-05:00:58" "2012-10-02-07:00:00" TRUE FALSE) "at_home"))], 60000)
Result   : (mlabel ((("2012-10-01" "2012-10-02-07:00" TRUE FALSE) "at_home")))

Operator : createml
Number   : 1
Signature: int x real -> mlabel
Example  : query createml(2, 0.5) matches '() ()'
Result   : TRUE

Operator : createmlrelation
Number   : 1
Signature: int x int x string -> bool
Example  : query createmlrelation(10, 50, "Dotraj")
Result   : FALSE

Operator : createtrie
Number   : 1
Signature: rel(tuple(..., mlabel, ...)) x attrname -> invfile
Example  : query Dotraj indexmatches[Trajectory, Dotraj createtrie[Trajectory], '(_ "Mengede") *'] count
Result   : 3
