Database: berlintest
Restore : No

Operator : matches
Number   : 1
Signature: mlabel x text -> bool
Example  : query [const mlabel value ((("2000-01-01" "2000-01-02" TRUE FALSE) "at_home"))] matches '()'
Result   : TRUE

Operator : matches
Number   : 2
Signature: mstring x text -> bool
Example  : query [const mstring value ((("2000-01-01" "2000-01-02" TRUE FALSE) "at_home"))] matches '()'
Result   : TRUE

Operator : rewrite
Number   : 1
Signature: mlabel x text -> stream(mlabel)
Example  : query [const mlabel value ((("2000-01-01" "2000-01-02" TRUE FALSE) "at_home"))] rewrite 'X () => X // X.label := "at_work"' count
Result   : 1

Operator : rewrite
Number   : 2
Signature: mstring x text -> stream(mlabel)
Example  : query [const mstring value ((("2000-01-01" "2000-01-02" TRUE FALSE) "at_home"))] rewrite 'X () => X // X.label := "at_work"' count
Result   : 1

Operator : compress
Number   : 1
Signature: mlabel -> mlabel
Example  : query compress([const mlabel value ((("2000-01-01" "2000-01-02" TRUE FALSE) "at_home"))])
Result   : 1

Operator : compress
Number   : 2
Signature: mstring -> mlabel
Example  : query compress([const mlabel value ((("2000-01-01" "2000-01-02" TRUE FALSE) "at_home"))])
Result   : 1

Operator : createml
Number   : 1
Signature: int -> mlabel
Example  : query createml(2) matches '() ()'
Result   : TRUE