Database : tsa_test
Restore  : NO


Operator : no_components
Number   : 1
Signature: pointseq -> int
Example  : query no_components([const pointseq value ((0.0 0.0) (1.0 1.0))])
Result   : 2

Operator : no_components
Number   : 2
Signature: tpointseq -> int
Example  : query no_components([const tpointseq value (("2015-12-28" (0.0 0.0)) ("2015-12-29" (1.0 1.0)))])
Result   : 2


Operator : isempty
Number   : 1
Signature: pointseq -> bool
Example  : query isempty([const pointseq value ((0.0 0.0) (1.0 1.0))])
Result   : FALSE

Operator : isempty
Number   : 2
Signature: tpointseq -> bool
Example  : query isempty([const tpointseq value (("2015-12-28" (0.0 0.0)) ("2015-12-29" (1.0 1.0)))])
Result   : FALSE


Operator : to_dline
Number   : 1
Signature: pointseq -> dline
Example  : query to_dline([const pointseq value ((0.0 0.0) (1.0 1.0))])
Result   : (dline ((0.0 0.0 1.0 1.0)))

Operator : to_dline
Number   : 2
Signature: tpointseq -> dline
Example  : query to_dline([const tpointseq value (("2015-12-28" (0.0 0.0)) ("2015-12-29" (1.0 1.0)))])
Result   : (dline ((0.0 0.0 1.0 1.0)))


Operator : to_pointseq
Number   : 1
Signature: mpoint -> pointseq
Example  : query to_pointseq([const mpoint value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) (1.0 2.3 -2.0 0.0)))])
Result   : (pointseq ((1.0 2.3) (-2.0 0.0)))

Operator : to_pointseq
Number   : 2
Signature: tpointseq -> pointseq
Example  : query to_pointseq([const tpointseq value (("2015-12-28" (0.0 0.0)) ("2015-12-29" (1.0 1.0)))])
Result   : (pointseq ((0.0 0.0) (1.0 1.0)))


Operator : to_tpointseq
Number   : 1
Signature: mpoint -> tpointseq
Example  : query to_tpointseq([const mpoint value ((("2015-12-29-01:23:45" "2015-12-29-01:30:20" TRUE FALSE) (1.0 2.3 -2.0 0.0)))])
Result   : (tpointseq (("2015-12-29-01:23:45" (1.0 2.3)) ("2015-12-29-01:30:20" (-2.0 0.0))))


Operator : dist_origin
Number   : 1
Signature: pointseq x pointseq -> real
Example  : query dist_origin([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))])
Result   : (real 1.860107523773827)

Operator : dist_origin
Number   : 2
Signature: pointseq x pointseq x geoid -> real
Example  : query dist_origin([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], create_geoid("WGS1984"))
Result   : (real 206067.0862065959)


Operator : dist_destination
Number   : 1
Signature: pointseq x pointseq -> real
Example  : query dist_destination([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))])
Result   : (real 4.060788100849391)

Operator : dist_destination
Number   : 2
Signature: pointseq x pointseq x geoid -> real
Example  : query dist_destination([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], create_geoid("WGS1984"))
Result   : (real 449506.9201455081)


Operator : dist_origin_and_destination
Number   : 1
Signature: pointseq x pointseq -> real
Example  : query dist_origin_and_destination([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))])
Result   : (real 2.960447812311609)

Operator : dist_origin_and_destination
Number   : 2
Signature: pointseq x pointseq x geoid -> real
Example  : query dist_origin_and_destination([const pointseq value ((1.0 2.3) (-2.0 0.0))], [const pointseq value ((2.5 1.2) (0.5 3.2))], create_geoid("WGS1984"))
Result   : (real 327787.003176052)
