Database: fmrdb
Restore : No

Operator : testoperatora
Number   : 1
Signature: int -> int
Example  : query testoperatora(0)
Result   : 2

Operator : atinstant
Number   : 1
Signature: fixedmregion x instant -> region
Example  : query mrain atinstant six30
Result   : (region((((-532.4056881208568 -23.82248424945967)(-407.5616371567141 -296.6117122971642)(92.55194759741086 -67.73095219623588)(-32.29210336673187 205.0582758514687)))))


Operator : fmr_traversed
Number   : 1
Signature: fixedmregion x double x double -> region
Example  : query fmr_traversed (mrain , six30 , six31)
Result   : (region())

Operator : inside
Number   : 1
Signature: mpoint x fixedmregion -> mbool
Example  : query initial(train7 inside mrain2)
Result   : (ibool ("2003-11-20-06:06" FALSE))

Operator : fmr_intersection
Number   : 1
Signature: (mpoint fixedmregion) -> mpoint
Example  : query train7 fmr_intersection mrain2
Result   : (mpoint((("2003-11-20-07:00:37.844" "2003-11-20-07:00:50" TRUE FALSE)(-2849.0 14461.0 -3019.0 14499.0))(("2003-11-20-07:00:50" "2003-11-20-07:01" TRUE FALSE)(-3019.0 14499.0 -3019.0 14499.0))(("2003-11-20-07:01" "2003-11-20-07:01:11.382" TRUE FALSE)(-3019.0 14499.0 -3175.0 14554.0))(("2003-11-20-07:01:11.382" "2003-11-20-07:01:18.469" TRUE FALSE)(-3175.0 14554.0 -3278.0 14555.0))(("2003-11-20-07:01:18.469" "2003-11-20-07:01:29.267" TRUE FALSE)(-3278.0 14555.0 -3423.0 14495.0))(("2003-11-20-07:01:29.267" "2003-11-20-07:01:38.530" TRUE FALSE)(-3423.0 14495.0 -3512.0 14394.0))(("2003-11-20-07:01:38.530" "2003-11-20-07:01:44.586" TRUE FALSE)(-3512.0 14394.0 -3544.0 14312.0))(("2003-11-20-07:01:44.586" "2003-11-20-07:01:50" TRUE FALSE)(-3544.0 14312.0 -3560.0 14235.0))))


Operator : interpolate
Number   : 1
Signature: ((stream iregion)) -> fixedmregion
Example  : query observations feed transformstream interpolate
Result   : (fixedmregion(((((-3.0 -10.4)(3.0 -10.4)(3.0 5.6)(0.0 9.6)(-3.0 5.6))))((("2000-01-03" "2000-01-03-02:24" FALSE TRUE)(0.0 0.4000000000000004 0.0 0.308806974113335 3.523764637042671 -0.1570796326794899))(("2000-01-03-02:24" "2000-01-03-04:48" FALSE TRUE)(0.308806974113335 3.523764637042671 -0.1570796326794899 1.10247647184691 6.56076249401701 -0.3141592653589791)))(6.9304779307719e-310 9.881312916824931e-323)0.0))


Operator : tripstommove
Number   : 1
Signature: mpoint -> mmove
Example  : query tripstommove([const mpoint value ()])
Result   : (mmove())

Operator : makefmr
Number   : 1
Signature: region x mmove x point -> fixedmregion
Example  : query makefmr([const region value ((((0.0 0.0)(0.0 1.0)(1.0 0.0))))],mmo,[const  point value(1.2 1.4)])
Result   : (fixedmregion(((((0.0 0.0)(1.0 0.0)(0.0 1.0))))((("2003-11-20-06:00" "2003-11-20-07:00" TRUE FALSE)(2.0 3.0 2.0 3.0 0.0 2.0)))(1.2 1.4)0.0))


Operator : makeiregion
Number   : 1
Signature : region x instnat -> iregion
Example   : query makeiregion(thecenter, six30)
Result    : (iregion ("2003-11-20-06:30" ( ( ( (4751.258065743784 11098.44273821416) (5174.969135626282 10226.09641786784) (5199.893316207606 9403.598458684168) (5125.120774463636 8680.797221825787) (4925.727329813048 7758.60254031682) (5523.90766376481 7708.754179154174) (6645.495789924366 7733.678359735497) (7567.690471433332 7484.436553922262) (8863.747861662152 7110.573845202411) (10134.88107130965 6562.241872413295) (11455.86264211979 6537.317691831971) (12951.3134769992 6861.332039389176) (14272.29504780934 7235.194748109027) (14297.21922839066 8406.631235431229) (14421.84013129728 9254.053375196227) (15044.94464583037 10774.42839065696) (15618.2007992008 12195.10668379239) (15094.79300699301 13216.99808762665) (13699.0388944389 14861.994005994) (12702.07167118596 15609.7194234337) (11605.40772560773 16307.59647971076) (10209.65361305362 16482.06574378002) (8788.975319918181 16133.1272156415) (7418.145387945392 15734.34032634032) (6271.633081204514 15485.09852052709) (5748.225288996721 14562.90383901812) (5698.376927834074 13391.46735169592) (5623.604386090105 12394.50012844298) (5100.196593882312 11322.76036344607)))))) 



