Database: berlintest
Restore : No

Operator : addtupleid
Number   : 1
Signature: (stream (tuple ((x1 t1) ... (xn tn)))) ->(stream (tuple ((x1 t1) ... (xn tn) (id tid))))
Example  : query plz feed addtupleid count
Result   : 41267


Operator : tupleid
Number   : 1
Signature: (tuple x) -> tid 
Example  : query plz feed extend[ TID : tupleid(.) ] count
Result   : 41267


Operator : =
Number   : 1
Signature: (tid tid) -> bool 
Example  : query plz feed head[4] loopsel[plz_Ort exactmatchS[.Ort]] {A} plz feed head[4] loopsel[plz_Ort  exactmatchS[.Ort]] {B} symmjoin[.id_A = ..id_B] count
Result   : 2336


Operator : #
Number   : 1
Signature: (tid tid) -> bool 
Example  : query plz feed head[4] loopsel[plz_Ort exactmatchS[.Ort]] {A} plz feed head[4] loopsel[plz_Ort  exactmatchS[.Ort]] {B} symmjoin[.id_A # ..id_B] count
Result   : 338720

Operator : <
Number   : 1
Signature: (tid tid) -> bool 
Example  : query plz feed head[4] loopsel[plz_Ort exactmatchS[.Ort]] {A} plz feed head[4] loopsel[plz_Ort  exactmatchS[.Ort]] {B} symmjoin[.id_A < ..id_B] count
Result   : 169360

Operator : >
Number   : 1
Signature: (tid tid) -> bool 
Example  : query plz feed head[4] loopsel[plz_Ort exactmatchS[.Ort]] {A} plz feed head[4] loopsel[plz_Ort  exactmatchS[.Ort]] {B} symmjoin[.id_A > ..id_B] count
Result   : 169360

Operator : <=
Number   : 1
Signature: (tid tid) -> bool 
Example  : query plz feed head[4] loopsel[plz_Ort exactmatchS[.Ort]] {A} plz feed head[4] loopsel[plz_Ort  exactmatchS[.Ort]] {B} symmjoin[.id_A <= ..id_B] count
Result   : 171696

Operator : >=
Number   : 1
Signature: (tid tid) -> bool 
Example  : query plz feed head[4] loopsel[plz_Ort exactmatchS[.Ort]] {A} plz feed head[4] loopsel[plz_Ort  exactmatchS[.Ort]] {B} symmjoin[.id_A >= ..id_B] count
Result   : 171696
